Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.aShapeNames
Shape names list.

Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.aShapeGuids
Shape GUID list.

Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.aGeometryGuids
Shape geometry GUID list.

Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.aFingerprints
Shape geometry fingerprint list.

Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.aExtremas
Shape extrema list.

Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.aSolidities
Shape solidity list.

Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t.aBrepTypes
Shape brep type list.